extra/doom/config.org
#+title: Doom Emacs Configuration
#+author: Mahdi Pourismaiel
#+startup: overview
#+options: toc:3 num:nil
#+TOC: headlines 3
#+PROPERTY: header-args:emacs-lisp :tangle config.el

This file is the literate version of the Doom Emacs configuration in this directory.
All Emacs Lisp blocks in this document tangle to =config.el= in the same folder.

* Overview
This configuration focuses on a few clear goals:

- Keep the editing experience comfortable and readable.
- Make project navigation and dashboard workflows faster.
- Prevent accidental Python and Pipenv behavior inside monorepos.
- Add a small set of practical keybindings without turning the setup into a grab bag.

Core Identity
Basic user identity and early package requirements that other sections rely on.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(require 'acp)
(require 'agent-shell)

(setq user-full-name "Mahdi Pourismaiel"
      user-mail-address "mpourismaiel@gmail.com")
#+end_src

** NVM Path
nvm is sourced in =.bashrc= which Emacs never reads. Add the active nvm node
bin to =exec-path= and =PATH= early so =executable-find= resolves node tools
like =tailwindcss-language-server= correctly.

#+begin_src emacs-lisp
(defun mp/nvm-add-to-path ()
  "Add the nvm default node bin directory to `exec-path' and PATH."
  (let* ((nvm-dir (expand-file-name "~/.nvm"))
         (alias-file (expand-file-name "alias/default" nvm-dir))
         (versions-dir (expand-file-name "versions/node" nvm-dir)))
    (when (file-readable-p alias-file)
      (let* ((alias (string-trim (with-temp-buffer
                                   (insert-file-contents alias-file)
                                   (buffer-string))))
             (match (car (last (sort
                                (seq-filter #'file-directory-p
                                            (file-expand-wildcards
                                             (expand-file-name (concat alias "*") versions-dir)))
                                #'string<))))
             (bin (when match (expand-file-name "bin" match))))
        (when (and bin (file-directory-p bin))
          (add-to-list 'exec-path bin)
          (setenv "PATH" (concat bin path-separator (getenv "PATH"))))))))

(mp/nvm-add-to-path)
#+end_src

* Appearance
Visual defaults for theme, fonts, line numbers, and general editor spacing.

** Theme And Fonts
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
(setq doom-font (font-spec :family "CaskaydiaCove Nerd Font Mono" :size 16))

;; Let Treemacs use richer git-state highlighting when Python is available.
(setq +treemacs-git-mode 'deferred)

(after! doom-themes
  (custom-set-faces!
    ;; JSX / HTML tags: <div>
    '(web-mode-html-tag-face :foreground "#ffcc66" :weight bold)
    '(web-mode-html-tag-bracket-face :foreground "#ffcc66")
    '(web-mode-html-attr-name-face :foreground "#82aaff")

    ;; React component / constructor-like names: BaseMaterialContainer
    '(font-lock-type-face :foreground "#c792ea" :weight bold)

    ;; Variables / props
    '(font-lock-variable-name-face :foreground "#89ddff")

    ;; Function names
    '(font-lock-function-name-face :foreground "#82aaff" :weight bold)))
#+end_src

** Comfortable Editing Spacing
This adds a small amount of extra vertical space in buffers intended for writing or editing code and config.

#+begin_src emacs-lisp
(defvar mp/editor-line-spacing 0.6
  "Preferred extra line spacing for editing buffers.")

(defun mp/apply-editor-line-spacing-h ()
  "Apply comfortable line spacing to editable buffers."
  (setq-local line-spacing mp/editor-line-spacing))

(add-hook 'text-mode-hook #'mp/apply-editor-line-spacing-h)
(add-hook 'prog-mode-hook #'mp/apply-editor-line-spacing-h)
(add-hook 'conf-mode-hook #'mp/apply-editor-line-spacing-h)
#+end_src

** Line Numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

* Configuration
** Editor Experience
*** Scrolling
#+begin_src emacs-lisp
(setq scroll-preserve-screen-position t
      scroll-conservatively 101
      scroll-margin 0
      mouse-wheel-follow-mouse t
      mouse-wheel-scroll-amount '(3 ((shift) . 1))
      mouse-wheel-progressive-speed nil)

(after! evil
  (setq evil-want-C-u-scroll t))
#+end_src

*** Project management
#+begin_src emacs-lisp
(defvar mp/project-bundles nil
  "Private project bundles loaded from private.el.")

(let ((private-config "~/.config/doom/private.el"))
  (when (file-exists-p private-config)
    (load-file private-config)))

(defun mp/open-project-root (project-dir)
  "Open PROJECT-DIR without Projectile's project-action prompt."
  (let* ((dir (file-name-as-directory (expand-file-name project-dir)))
         (preferred-files '("README.md" "package.json" "Cargo.toml" "pyproject.toml"))
         (file (seq-find
                (lambda (name)
                  (file-exists-p (expand-file-name name dir)))
                preferred-files)))
    (unless (file-directory-p dir)
      (user-error "Project directory does not exist: %s" dir))
    (projectile-add-known-project dir)
    (setq default-directory dir)
    (if file
        (find-file (expand-file-name file dir))
      (dired dir))))

(defun mp/open-project-bundle (bundle-name)
  "Open project bundle BUNDLE-NAME in separate Doom workspaces."
  (interactive
   (list (completing-read "Bundle: " (mapcar #'car mp/project-bundles) nil t)))
  (let ((projects (cdr (assoc bundle-name mp/project-bundles))))
    (unless projects
      (user-error "Unknown bundle: %s" bundle-name))
    (dolist (project projects)
      (+workspace-switch (car project) t)
      (mp/open-project-root (cdr project)))))

(defun mp/open-elvou-bundle ()
  "Open Elvou backend/frontend/app projects."
  (interactive)
  (mp/open-project-bundle "elvou"))

(defun mp/project-menu ()
  "Project menu with colorized bundles plus Projectile projects."
  (interactive)
  (let* ((bundle-prefix "▶ Bundle: ")

         (bundle-candidates
          (mapcar
           (lambda (bundle)
             (let* ((name (car bundle))
                    (label (concat bundle-prefix name)))
               (cons
                (propertize label 'face '(:foreground "#a6e3a1" :weight bold))
                label)))
           mp/project-bundles))

         (project-candidates
          (mapcar
           (lambda (project)
             (let* ((dir (directory-file-name project))
                    (name (file-name-nondirectory dir))
                    (parent (file-name-directory dir))
                    (label
                     (concat
                      parent
                      (propertize name 'face '(:foreground "#89b4fa" :weight bold)))))
               (cons label project)))
           (projectile-relevant-known-projects)))

         (candidates (append bundle-candidates project-candidates))
         (choice
          (completing-read
           "Project: "
           candidates
           nil
           t)))

    (let ((real-value (cdr (assoc choice candidates))))
      (if (string-prefix-p bundle-prefix real-value)
          (mp/open-project-bundle
           (string-remove-prefix bundle-prefix real-value))
        (projectile-switch-project-by-name real-value)))))

(map! :leader
      :desc "Project menu"
      "p p" #'mp/project-menu)
#+end_src

*** Splits
Use Doom Dashboard as buffer for the new split.
Also focus the new split immediately.
#+begin_src emacs-lisp
(defun mp/split-target-buffer ()
  "Populate a newly-created split."
  (if (derived-mode-p 'vterm-mode)
      ;; If we're currently in vterm, create a fresh vterm.
      (mp/vterm-new)

    ;; Otherwise show the Doom dashboard.
    (cond
     ;; Reuse existing dashboard buffer.
     ((get-buffer "*doom*")
      (switch-to-buffer "*doom*"))

     ;; Create a dashboard if possible.
     ((fboundp '+doom-dashboard/open)
      (+doom-dashboard/open))

     ;; Fallback for non-dashboard Doom configs.
     (t
      (switch-to-buffer (generate-new-buffer "untitled"))))))

(defun mp/split-window-right-fresh ()
  "Split right and show a fresh buffer."
  (interactive)
  (select-window (split-window-right))
  (mp/split-target-buffer))

(defun mp/split-window-below-fresh ()
  "Split below and show a fresh buffer."
  (interactive)
  (select-window (split-window-below))
  (mp/split-target-buffer))

(map! :leader
      (:prefix ("w" . "window")
       :desc "Split right (fresh)" "v" #'mp/split-window-right-fresh
       :desc "Split below (fresh)" "s" #'mp/split-window-below-fresh))
#+end_src

** Formatting
#+begin_src emacs-lisp
(defun mp/save-without-format ()
  "Save current buffer without running format-on-save hooks."
  (interactive)
  (let ((before-save-hook
         (remove #'+format/buffer before-save-hook)))
    (save-buffer)))

(map! :leader
      (:prefix ("f" . "file")
        :desc "Save without formatting" "!"
        #'mp/save-without-format))

(after! format-all
  (setq-hook! '(js-mode-hook
                js-ts-mode-hook
                typescript-mode-hook
                typescript-ts-mode-hook
                typescript-tsx-mode-hook
                tsx-ts-mode-hook
                web-mode-hook
                css-mode-hook
                css-ts-mode-hook
                scss-mode-hook)
    +format-with 'prettier))
#+end_src

*** Special formatting
To disable formatting create .dir-locals.el

#+begin_src emacs-lisp
;; ((nil . ((eval . (format-all-mode -1)))))
#+end_src

To change formatter to Ruff for python files in a certain project use this

#+begin_src emacs-lisp
;; ((python-mode . ((+format-with . ("ruff" "format" "-"))))
;;  (python-ts-mode . ((+format-with . ("ruff" "format" "-")))))
#+end_src

** Completion Styles
I really have to organize

#+begin_src emacs-lisp
(after! vertico
  (setq completion-styles '(flex orderless basic)
        completion-category-defaults nil))
#+end_src

** Corfu
Enable automatic popup with short delay and single-character prefix so completion feels instant, like VSCode IntelliSense.

#+begin_src emacs-lisp
(after! corfu
  (setq corfu-auto t
        corfu-auto-delay 0.1
        corfu-auto-prefix 1
        corfu-preview-current nil
        corfu-preselect 'prompt))
#+end_src

** Mode Line
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :hook (emacs-startup . doom-modeline-mode)
  :config (column-number-mode 1)
  :custom
  (doom-modeline-height 40)
  (doom-modeline-window-width-limit nil)

  (doom-modeline-buffer-file-name-style 'relative-from-project)

  (doom-modeline-icon t)
  (doom-modeline-major-mode-color-icon t)
  (doom-modeline-buffer-modification-icon t)
  (doom-modeline-buffer-state-icon t)

  (doom-modeline-indent-info t))
#+end_src

