extra/doom/config.org
** Header Line
#+begin_src emacs-lisp
(require 'subr-x)

(defvar mp/header-line-height 32
  "Target height of the custom header line, in pixels.")

(defvar mp/header-line-horizontal-padding " "
  "Horizontal padding inserted around each header line block.")

(defvar mp/header-line-buffer-foreground-faces
  '(doom-modeline-buffer-file mode-line-buffer-id mode-line)
  "Faces whose foreground is reused for header file and major-mode text.")

(defvar mp/header-line-position-foreground-faces
  '(doom-modeline mode-line line-number)
  "Faces whose foreground is reused for the header status text.")

(custom-set-faces!
  '(header-line :inherit mode-line))

(defun mp/header-line-color-value (value)
  "Return VALUE unless it is an unspecified face color."
  (unless (or (null value)
              (eq value 'unspecified)
              (and (stringp value)
                   (string-prefix-p "unspecified-" value)))
    value))

(defun mp/header-line-face-attribute (face attribute)
  "Return FACE ATTRIBUTE after resolving inheritance where possible."
  (when (facep face)
    (mp/header-line-color-value
     (face-attribute face attribute nil 'default))))

(defun mp/header-line-first-face-attribute (faces attribute fallback)
  "Return the first usable ATTRIBUTE from FACES, or FALLBACK."
  (or (catch 'value
        (dolist (face faces)
          (when-let ((value (mp/header-line-face-attribute face attribute)))
            (throw 'value value))))
      (mp/header-line-color-value fallback)))

(defun mp/header-line-background ()
  "Return the themed background color for the header line."
  (mp/header-line-first-face-attribute
   '(header-line mode-line default)
   :background
   (face-attribute 'default :background nil 'default)))

(defun mp/header-line-buffer-foreground ()
  "Return the themed modeline buffer-name foreground color."
  (mp/header-line-first-face-attribute
   mp/header-line-buffer-foreground-faces
   :foreground
   (face-attribute 'mode-line :foreground nil 'default)))

(defun mp/header-line-position-foreground ()
  "Return the themed modeline position foreground color."
  (mp/header-line-first-face-attribute
   mp/header-line-position-foreground-faces
   :foreground
   (face-attribute 'mode-line :foreground nil 'default)))

(defun mp/header-line-vertical-padding ()
  "Return vertical padding needed to approach `mp/header-line-height'."
  (if (display-graphic-p)
      (ceiling (max 0 (- mp/header-line-height (frame-char-height))) 2)
    0))

(defun mp/header-line-face (foreground background &optional weight)
  "Return a face plist for a padded header line block."
  (append
   (when foreground
     `(:foreground ,foreground))
   (when background
     `(:background ,background))
   (when weight
     `(:weight ,weight))
   (when-let ((padding (mp/header-line-vertical-padding)))
     (when (> padding 0)
       `(:box (:line-width (0 . ,padding)
               ,@(when background
                   `(:color ,background))))))))

(defun mp/header-line-block (text face)
  "Return TEXT as a padded header line block using FACE."
  (propertize
   (concat mp/header-line-horizontal-padding
           text
           mp/header-line-horizontal-padding)
   'face face))

(defun mp/header-line-buffer-name ()
  "Return the file name or buffer name for the header line."
  (or (when buffer-file-name
        (file-name-nondirectory buffer-file-name))
      (buffer-name)
      ""))

(defun mp/header-line-mode-name ()
  "Return the current major mode name for the header line."
  (let ((name (string-trim (format-mode-line mode-name))))
    (if (string-empty-p name)
        "unknown"
      (downcase name))))

(defun mp/header-line-buffer-status ()
  "Return the current buffer status label."
  (cond (buffer-read-only
         "RO")
        ((buffer-modified-p)
         "W!")
        (t
         "RW")))

(defun mp/header-line-format ()
  "Return a left-aligned custom header line for the current buffer."
  (let* ((background (mp/header-line-background))
         (buffer-foreground (mp/header-line-buffer-foreground))
         (position-foreground (mp/header-line-position-foreground))
         (status-background "#ecbe7b")
         (status-foreground "#ffffff")
         (status-face (mp/header-line-face
                       status-foreground status-background 'bold))
         (buffer-face (mp/header-line-face
                       buffer-foreground background 'bold))
         (major-face (mp/header-line-face
                      buffer-foreground background 'normal)))
    (list
     (mp/header-line-block (mp/header-line-buffer-status) status-face)
     (mp/header-line-block (mp/header-line-buffer-name) buffer-face)
     (mp/header-line-block (mp/header-line-mode-name) major-face))))

(setq-default header-line-format '(:eval (mp/header-line-format)))
#+end_src

** Consult
Use consult for `SPC SPC` and be done with `SPC b b`.

#+begin_src emacs-lisp
(defvar consult-source-projectile-file
  `(:name "Projectile File"
    :narrow (?p . "Projectile File")
    :category file
    :face consult-file
    :history file-name-history
    :state ,#'consult--file-state
    :action ,#'consult--file-action
    :new ,#'consult--file-action
    :enabled ,(lambda ()
                (and (bound-and-true-p projectile-mode)
                     (projectile-project-p)))
    :items ,(lambda ()
              (let ((root (projectile-project-root)))
                (mapcar
                 (lambda (file)
                   (cons file (expand-file-name file root)))
                 (projectile-project-files root))))))

(with-eval-after-load 'consult
  (setq consult-buffer-sources
        '(consult-source-buffer
          consult-source-projectile-file
          consult-source-hidden-buffer
          consult-source-project-buffer-hidden
          consult-source-project-recent-file-hidden)))

(map! :leader
     "SPC" #'consult-buffer)
#+end_src

** Minibuffer

*** Vertico posframe
#+begin_src emacs-lisp
(use-package! vertico-posframe
  :after vertico
  :config
  (setq vertico-posframe-width 120
        vertico-posframe-height 18
        vertico-posframe-border-width 4
        vertico-posframe-poshandler #'posframe-poshandler-frame-center
        vertico-posframe-parameters
        '((left-fringe . 16)
          (right-fringe . 16)
          (internal-border-width . 12)
          (alpha-background . 96)
          (undecorated . t)))

  (custom-set-faces!
    '(vertico-posframe :background "#232833")
    '(vertico-posframe-border :background "#3b4252")
    '(vertico-current :background "#343b4a" :weight bold)
    '(minibuffer-prompt :foreground "#c678dd" :weight bold))

  (vertico-posframe-mode 1))
#+end_src

*** dimmer
#+begin_src emacs-lisp
(use-package! dimmer
  :config
  (setq dimmer-fraction 0.5
        dimmer-use-colorspace :rgb
        dimmer-watch-frame-focus-events nil
        dimmer-adjustment-mode :foreground
        dimmer-exclusion-regexp-list
        '("^ \\*Minibuf"
          "^\\*Echo Area"
          "^\\*which-key"
          "^ \\*which-key"
          "^\\*Completions"
          "^\\*corfu"
          "^ \\*LV\\*"))

  ;; Do NOT let every transient minibuffer/evil command trigger dimming.
  ;; Only force dimming around Vertico/posframe minibuffer sessions.
  (add-hook 'vertico-posframe-mode-hook
            (lambda ()
              (if vertico-posframe-mode
                  (progn
                    (add-hook 'minibuffer-setup-hook #'dimmer-process-all)
                    (add-hook 'minibuffer-exit-hook  #'dimmer-process-all))
                (remove-hook 'minibuffer-setup-hook #'dimmer-process-all)
                (remove-hook 'minibuffer-exit-hook  #'dimmer-process-all))))

  (dimmer-mode 1))
#+end_src

** Visuals
#+begin_src emacs-lisp
(use-package! spacious-padding
  :custom
  (spacious-padding-widths
        '( :internal-border-width 8
           :header-line-width 0
           :mode-line-width 0
           :tab-width 4
           :right-divider-width 30
           :scroll-bar-width 8))

  (spacious-padding-mode 1))
#+end_src
* Org Defaults
** Org defaults
Core path and file behavior settings.

#+begin_src emacs-lisp
(setq org-directory "~/org/")

;; Send files to trash instead of fully deleting.
(setq delete-by-moving-to-trash t)

;; Save automatically.
(setq auto-save-default t)
#+end_src

** Auto-Tangle On Save
When this exact file is saved, Emacs immediately regenerates =config.el=. That keeps the literate source and the generated file synchronized without manual copying.

#+begin_src emacs-lisp
(after! org
  (defun mp/doom-config-org-file-p (&optional file)
    "Return non-nil when FILE is the Doom literate config."
    (let ((file (or file buffer-file-name)))
      (and file
           (file-equal-p (file-truename file)
                         (file-truename (expand-file-name "config.org" doom-user-dir))))))

  (defun mp/org-babel-tangle-doom-config-h ()
    "Tangle the Doom literate config after saving `config.org'."
    (when (mp/doom-config-org-file-p)
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (defun mp/enable-doom-config-auto-tangle-h ()
    "Enable local auto-tangling for the Doom literate config buffer."
    (when (mp/doom-config-org-file-p)
      (add-hook 'after-save-hook #'mp/org-babel-tangle-doom-config-h nil t)))

  (add-hook 'org-mode-hook #'mp/enable-doom-config-auto-tangle-h))
#+end_src

** Org mode specifics

#+begin_src  emacs-lisp
(add-hook 'org-mode-hook 'visual-line-mode)
(add-hook 'org-mode-hook 'olivetti-mode)
(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1)))

;; Show line numbers only in insert state, hide in normal state.
(add-hook 'evil-insert-state-entry-hook
          (lambda () (when (derived-mode-p 'org-mode) (display-line-numbers-mode 1))))
(add-hook 'evil-insert-state-exit-hook
          (lambda () (when (derived-mode-p 'org-mode) (display-line-numbers-mode -1))))

(after! org
  ;; Prevent alphabetical list markers from conflicting with checkbox parsing.
  (setq org-list-allow-alphabetical nil)

  (setq org-auto-align-tags nil
        org-tags-column 0
        org-catch-invisible-edits 'show-and-error
        org-special-ctrl-a/e t
        org-insert-heading-respect-content t
        org-hide-emphasis-markers t
        org-pretty-entities t
        org-agenda-tags-column 0
        org-ellipsis "…"))

(after! org-modern
  (setq org-modern-symbol 'caskaydia)
  (dolist (face '(window-divider
                  window-divider-first-pixel
                  window-divider-last-pixel))
    (face-spec-reset-face face)
    (set-face-foreground face (face-attribute 'default :background)))
  ;; (set-face-background 'fringe (face-attribute 'default :background))
  (setq org-modern-block-fringe t)
  (global-org-modern-mode))
#+end_src

* Help And Feedback
Make transient help UI appear quickly and remain readable.

#+begin_src emacs-lisp
(setq which-key-idle-delay 0.2)

;; Give hover/help text enough room to be readable.
(setq eldoc-echo-area-use-multiline-p 3)
#+end_src

* Dashboard
The stock Doom dashboard is replaced with a project-aware workspace card that surfaces common actions, recent files, and lightweight git status.

