extra/doom/config.el

;; Send files to trash instead of fully deleting.
(setq delete-by-moving-to-trash t)

;; Save automatically.
(setq auto-save-default t)

(after! org
  (defun mp/doom-config-org-file-p (&optional file)
    "Return non-nil when FILE is the Doom literate config."
    (let ((file (or file buffer-file-name)))
      (and file
           (file-equal-p (file-truename file)
                         (file-truename (expand-file-name "config.org" doom-user-dir))))))

  (defun mp/org-babel-tangle-doom-config-h ()
    "Tangle the Doom literate config after saving `config.org'."
    (when (mp/doom-config-org-file-p)
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (defun mp/enable-doom-config-auto-tangle-h ()
    "Enable local auto-tangling for the Doom literate config buffer."
    (when (mp/doom-config-org-file-p)
      (add-hook 'after-save-hook #'mp/org-babel-tangle-doom-config-h nil t)))

  (add-hook 'org-mode-hook #'mp/enable-doom-config-auto-tangle-h))

(setq which-key-idle-delay 0.2)

;; Give hover/help text enough room to be readable.
(setq eldoc-echo-area-use-multiline-p 3)
