extra/doom/config.org
** Dashboard Widgets
#+begin_src emacs-lisp
  (defun mp/dashboard-widget-recent-files ()
    "Show the five most recent files for the active project."
    (let* ((root (mp/dashboard-project-root))
           (files (mp/dashboard-recent-files 5))
           (title (if root
                      (format "Recent files in %s" (mp/dashboard-project-name))
                    "Recent files")))
      (mp/dashboard-insert-block-title title)
      (if files
          (dolist (file files)
            (mp/dashboard-insert-centered-button
             (if root
                 (file-relative-name file root)
               (abbreviate-file-name file))
             `(lambda (_) (mp/dashboard-open-recent-file ,file))
             file
             '+dashboard-menu-desc))
        (+dashboard-insert
         (propertize "No recent files available yet." 'face '+dashboard-menu-desc)))))

  (defun mp/dashboard-git-summary ()
    "Return a summary plist for the git repo at `default-directory'."
    (when-let ((root (ignore-errors (magit-toplevel default-directory))))
      (let ((default-directory root)
            (staged 0)
            (unstaged 0)
            (untracked 0))
        (dolist (line (magit-git-lines "status" "--short"))
          (cond
           ((string-prefix-p "??" line)
            (cl-incf untracked))
           (t
            (let ((x (aref line 0))
                  (y (aref line 1)))
              (unless (eq x ?\s)
                (cl-incf staged))
              (unless (eq y ?\s)
                (cl-incf unstaged))))))
        (list :root root
              :branch (or (magit-get-current-branch) "detached")
              :staged staged
              :unstaged unstaged
              :untracked untracked))))

  (defun mp/dashboard-widget-git ()
    "Show lightweight git information for the active project."
    (when-let* ((summary (mp/dashboard-git-summary))
                (branch (plist-get summary :branch)))
      (mp/dashboard-insert-block-title
       (format "Git: %s" branch)
       (format "Staged %d  Unstaged %d  Untracked %d"
               (plist-get summary :staged)
               (plist-get summary :unstaged)
               (plist-get summary :untracked)))
      (mp/dashboard-insert-centered-button
       "Open Magit status"
       (lambda (_) (mp/dashboard-magit-status))
       "Inspect the current repository with Magit"
       '+dashboard-menu-desc)))

  (defun mp/dashboard-widget-main ()
    "Render a plain, robust dashboard body."
    (let ((root (mp/dashboard-project-root))
          (recent-files (mp/dashboard-recent-files 5))
          (git (mp/dashboard-git-summary)))
      (+dashboard-insert "")
      (+dashboard-insert (mp/dashboard-card-rule))
      (mp/dashboard-insert-card-line
       (propertize "Workspace" 'face 'mp/dashboard-meta-face))
      (mp/dashboard-insert-heading "Actions")
      (mp/dashboard-insert-button-line
       "Find file in project"
       (lambda (_) (mp/dashboard-open-project))
       "Jump to a file in the current project")
      (mp/dashboard-insert-button-line
       "Open project scratch"
       (lambda (_) (mp/dashboard-open-project-scratch))
       "Open a project scratch buffer")
      (when git
        (mp/dashboard-insert-button-line
         "Open Magit status"
         (lambda (_) (mp/dashboard-magit-status))
         "Inspect the current repository with Magit"))
      (mp/dashboard-insert-button-line
       "Recent files picker"
       (lambda (_) (call-interactively #'recentf-open-files))
       "Open the global recent files picker")
      (when (fboundp 'org-agenda)
        (mp/dashboard-insert-button-line
         "Open org-agenda"
         (lambda (_) (call-interactively #'org-agenda))
         "Open org-agenda"))
      (when (file-directory-p doom-user-dir)
        (mp/dashboard-insert-button-line
         "Open private configuration"
         (lambda (_) (call-interactively #'doom/open-private-config))
         "Open your Doom private config"))
      (mp/dashboard-insert-button-line
       "Open documentation"
       (lambda (_) (call-interactively #'doom/help))
       "Open Doom documentation")

      (mp/dashboard-insert-card-line)
      (mp/dashboard-insert-heading
       (if root
           (format "Recent Files in %s" (mp/dashboard-project-name))
         "Recent Files"))
      (if recent-files
          (dolist (file recent-files)
            (mp/dashboard-insert-button-line
             (if root
                 (file-relative-name file root)
               (abbreviate-file-name file))
             `(lambda (_) (mp/dashboard-open-recent-file ,file))
             file
             'mp/dashboard-meta-face))
        (mp/dashboard-insert-text-line "No recent files available yet."))

      (when git
        (mp/dashboard-insert-card-line)
        (mp/dashboard-insert-heading
         (format "Git: %s" (plist-get git :branch)))
        (mp/dashboard-insert-text-line
         (format "Staged: %d   Unstaged: %d   Untracked: %d"
                 (plist-get git :staged)
                 (plist-get git :unstaged)
                 (plist-get git :untracked))))
      (+dashboard-insert (mp/dashboard-card-rule-bottom))))

  (setq +dashboard-menu-sections
        '(("Find file in project"
           :icon (nerd-icons-octicon "nf-oct-file_directory_open" :face '+dashboard-menu-title)
           :action mp/dashboard-open-project)
          ("Open project scratch"
           :icon (nerd-icons-octicon "nf-oct-pencil" :face '+dashboard-menu-title)
           :action mp/dashboard-open-project-scratch)
          ("Open Magit status"
           :icon (nerd-icons-octicon "nf-oct-git_branch" :face '+dashboard-menu-title)
           :when (ignore-errors (magit-toplevel default-directory))
           :action mp/dashboard-magit-status)
          ("Recent files picker"
           :icon (nerd-icons-octicon "nf-oct-history" :face '+dashboard-menu-title)
           :action recentf-open-files)
          ("Open org-agenda"
           :icon (nerd-icons-octicon "nf-oct-calendar" :face '+dashboard-menu-title)
           :when (fboundp 'org-agenda)
           :action org-agenda)
          ("Open private configuration"
           :icon (nerd-icons-octicon "nf-oct-tools" :face '+dashboard-menu-title)
           :when (file-directory-p doom-user-dir)
           :action doom/open-private-config)
          ("Open documentation"
           :icon (nerd-icons-octicon "nf-oct-book" :face '+dashboard-menu-title)
           :action doom/help)))

  (setq +dashboard-functions
        '(+dashboard-widget-banner
          mp/dashboard-widget-main
          +dashboard-widget-loaded
          +dashboard-widget-footer)))
#+end_src

* Whitespace And Indentation
Make tabs and spaces visible in code-like buffers so indentation issues are easy to spot.

#+begin_src emacs-lisp
(defun mp/show-indent-style-h ()
  "Show tabs and spaces visibly in code-like buffers."
  (setq-local whitespace-style
              '(face tabs tab-mark spaces space-mark trailing))
  (setq-local whitespace-display-mappings
              '((tab-mark ?\t [?\u2192 ?\t] [?\\ ?\t])
                (space-mark ?\  [?\u00b7] [?.])))
  (whitespace-mode +1))

(add-hook 'prog-mode-hook #'mp/show-indent-style-h)
(add-hook 'conf-mode-hook #'mp/show-indent-style-h)
#+end_src

* Python And Pipenv Safeguards
This section exists to stop Pipenv from being inferred, created, or invoked in the wrong directory, especially inside monorepos where a repository root is not the correct Python project root.

