extra/doom/config.org
** Project Detection And Process Guards
#+begin_src emacs-lisp
;; Never let Doom infer or create a Pipenv project at a monorepo root.
;; Only an already-existing ancestor Pipfile counts as a valid Pipenv root.
(defun mp/pipenv-project-p (&optional dir)
  (when-let ((root (locate-dominating-file (or dir default-directory) "Pipfile")))
    (expand-file-name root)))

(defun mp/pipenv-allowed-p (&optional dir)
  (not (null (mp/pipenv-project-p dir))))

(defun mp/pipenv-command-p (program)
  (and (stringp program)
       (string= (file-name-nondirectory program) "pipenv")))

(defun mp/pipenv-command-list-p (command)
  (and (consp command)
       (mp/pipenv-command-p (car command))))

(defun mp/block-pipenv-outside-project (origin &optional dir)
  (unless (mp/pipenv-allowed-p dir)
    (user-error "Blocked %s outside a directory that already contains an ancestor Pipfile" origin)))

(defun mp/call-process-guard-a (fn program &rest args)
  (when (mp/pipenv-command-p program)
    (mp/block-pipenv-outside-project 'call-process default-directory))
  (apply fn program args))

(defun mp/process-file-guard-a (fn program &rest args)
  (when (mp/pipenv-command-p program)
    (mp/block-pipenv-outside-project 'process-file default-directory))
  (apply fn program args))

(defun mp/start-file-process-guard-a (fn name buffer program &rest program-args)
  (when (mp/pipenv-command-p program)
    (mp/block-pipenv-outside-project 'start-file-process default-directory))
  (apply fn name buffer program program-args))

(defun mp/make-process-guard-a (fn &rest args)
  (let ((command (plist-get args :command))
        (dir (or (plist-get args :default-directory) default-directory)))
    (when (mp/pipenv-command-list-p command)
      (mp/block-pipenv-outside-project 'make-process dir)))
  (apply fn args))

;; Define this early so any stale autoloads or callers resolve to the safe
;; version even if the `pipenv' package is disabled.
(defalias 'pipenv-project-p #'mp/pipenv-project-p)
(advice-add 'call-process :around #'mp/call-process-guard-a)
(advice-add 'process-file :around #'mp/process-file-guard-a)
(advice-add 'start-file-process :around #'mp/start-file-process-guard-a)
(advice-add 'make-process :around #'mp/make-process-guard-a)
#+end_src

** Doom Python Integration Overrides
#+begin_src emacs-lisp
(after! python
  ;; Stop Doom/python-mode from auto-enabling pipenv.
  (remove-hook 'python-mode-local-vars-hook #'pipenv-mode)
  (remove-hook 'python-ts-mode-local-vars-hook #'pipenv-mode)

  ;; Hard-disable pipenv-mode if loaded.
  (setq pipenv-with-projectile nil)

  ;; Doom's default REPL helper tries to route through pipenv when available.
  ;; Force plain `run-python' so opening a REPL never shells out to pipenv.
  (defun mp/+python/open-repl-no-pipenv ()
    (interactive)
    (require 'python)
    (unless python-shell-interpreter
      (user-error "`python-shell-interpreter' isn't set"))
    (pop-to-buffer
     (process-buffer
      (run-python nil (bound-and-true-p python-shell-dedicated) t))))

  (advice-add '+python/open-repl :override #'mp/+python/open-repl-no-pipenv)

  ;; Likewise, project script execution should run the interpreter directly.
  (set-eval-handler! '(python-mode python-ts-mode)
    '((:command . (lambda () python-shell-interpreter))
      (:exec . (lambda () "%c %o %s %a"))
      (:description . "Run Python script"))))

(after! pipenv
  (advice-add 'pipenv-project-p :override #'mp/pipenv-project-p)
  (pipenv-mode -1))

(after! doom-modeline
  ;; The Python env segment can shell out to `pipenv run ...` on Python buffers.
  ;; Disable it so merely visiting files can't hit pipenv.
  (setq doom-modeline-env-enable-python nil))
#+end_src

* Project Root Behavior
Prefer language-specific project markers over the repository root when working in monorepos.

#+begin_src emacs-lisp
(after! projectile
  ;; Doom's Python helpers still consult Projectile in a few places.
  ;; Make sure `server/Pipfile` counts as a project root before `.git` does.
  (add-to-list 'projectile-project-root-files "Pipfile"))

(after! project
  (defun mp/project-root-from-markers (dir markers)
    "Return the first project root above DIR matching one of MARKERS."
    (when-let ((root (seq-some (lambda (marker)
                                 (locate-dominating-file dir marker))
                               markers)))
      (cons 'transient root)))

  ;; Prefer language-specific roots inside monorepos over the repository root.
  ;; This keeps `server/` Python tooling anchored to its own Pipfile/pyproject
  ;; instead of falling back to the top-level `.git` directory.
  (add-hook 'project-find-functions
            (lambda (dir)
              (or (mp/project-root-from-markers dir '("go.mod"))
                  (mp/project-root-from-markers dir '("Cargo.toml"))
                  (mp/project-root-from-markers dir '("package.json"))
                  (mp/project-root-from-markers
                   dir
                   '("Pipfile" "pyproject.toml" "setup.py" "requirements.txt"))
                  (mp/project-root-from-markers dir '(".git"))))))
#+end_src

* Keybindings
This section documents the custom bindings defined in this configuration.

** Reference Table
| Context     | Keys       | Command                         | Purpose                                                                     |
|-------------+------------+---------------------------------+-----------------------------------------------------------------------------|
| Global      | =C-`=      | =mp/vterm-toggle=               | Toggle the vterm popup from the current project root.                       |
| Global      | =C-\=      | =mp/vterm-new=                  | Open a new uniquely named vterm buffer for another long-running process.    |
| Global      | =C-/=      | =comment-line=                  | Comment or uncomment the current line or region.                            |
| Global      | =M-<up>=   | =mp/move-lines-up=              | Move the current line, or the selected lines, upward by one line.           |
| Global      | =M-<down>= | =mp/move-lines-down=            | Move the current line, or the selected lines, downward by one line.         |
| Leader      | =SPC t t=  | =+eval/test=                    | Run the nearest test.                                                       |
| Leader      | =SPC t a=  | =+eval/test-all=                | Run all tests for the current project.                                      |
| Leader      | =SPC d a=  | =agent-shell=                   | Open the agent shell.                                                       |
| Leader      | =SPC d s=  | =minuet-show-suggestion=        | Request a Minuet overlay suggestion.                                        |
| Leader      | =SPC d m=  | =minuet-configure-provider=     | Configure the active Minuet provider and model.                             |
| Minuet      | =h=        | =minuet-previous-suggestion=    | Move to the previous visible suggestion.                                    |
| Minuet      | =l=        | =minuet-next-suggestion=        | Move to the next visible suggestion.                                        |
| Minuet      | =TAB=      | =minuet-accept-suggestion=      | Accept the whole visible suggestion.                                        |
| Minuet      | =RET=      | =minuet-accept-suggestion=      | Accept the whole visible suggestion.                                        |
| Minuet      | =x=        | =minuet-dismiss-suggestion=     | Dismiss the visible suggestion.                                             |
| Minuet      | =a=        | =minuet-accept-suggestion-line= | Accept one line of the visible suggestion.                                  |
| Leader      | =SPC .=    | =find-file=                     | Find a file from the current directory.                                     |
| Leader      | =SPC f d=  | =consult-dir=                   | Switch directories from the minibuffer workflow.                            |
| Minibuffer  | =C-x C-d=  | =consult-dir=                   | Pick a directory during completion.                                         |
| Minibuffer  | =C-x C-j=  | =consult-dir-jump-file=         | Jump to a file in another directory during completion.                      |
| Evil states | =C-b=      | =mp/treemacs-toggle-current-project= | Toggle Treemacs scoped to the current project across all Evil states.   |
| Evil states | =C-S-e=    | =treemacs-find-file=            | Reveal the current file in Treemacs.                                        |
| Evil states | =C-/=      | =comment-line=                  | Keep commenting available consistently across Evil states.                  |

** General Shortcuts
*** With Leader
#+begin_src emacs-lisp
(map! :leader
      :desc "Run nearest test" "t t" #'+eval/test
      :desc "Run all project tests" "t a" #'+eval/test-all
      (:prefix ("d" . "agent")
       :desc "Agent shell" "a" #'agent-shell))
#+end_src

*** Leaderless
#+begin_src emacs-lisp
(map! :n "gr" #'xref-find-references)
#+end_src

*** Mouse
#+begin_src emacs-lisp
(global-set-key [mouse-8] #'xref-go-back)
(global-set-key [mouse-9] #'xref-go-forward)
#+end_src

