extra/doom/config.org
** Global Shortcuts
#+begin_src emacs-lisp
(defun mp/project-root-default-directory (&optional dir)
  "Return the preferred project root for DIR, or `default-directory'."
  (let ((dir (file-name-as-directory
              (expand-file-name (or dir default-directory)))))
    (or (when (fboundp 'projectile-project-root)
          (let ((default-directory dir))
            (ignore-errors
              (file-name-as-directory
               (expand-file-name (projectile-project-root))))))
        (when (fboundp 'doom-project-root)
          (ignore-errors
            (file-name-as-directory
             (expand-file-name (doom-project-root dir)))))
        dir)))

(defun mp/vterm-toggle ()
  "Toggle the vterm popup from the current project root."
  (interactive)
  (let ((default-directory (mp/project-root-default-directory)))
    (+vterm/toggle nil)))

(defun mp/vterm-new ()
  "Open a fresh vterm buffer in the current window at project root."
  (interactive)
  (require 'vterm)
  (let* ((default-directory (mp/project-root-default-directory))
         (buffer-name (format "*vterm:%s*" (format-time-string "%Y%m%d-%H%M%S")))
         (buffer (generate-new-buffer buffer-name))
         (display-buffer-alist nil))
    (with-current-buffer buffer
      (vterm-mode))
    (switch-to-buffer buffer)))

(defun mp/line-move-bounds ()
  "Return the line-aligned bounds for the current line or active region."
  (if (use-region-p)
      (cons (save-excursion
              (goto-char (region-beginning))
              (line-beginning-position))
            (save-excursion
              (goto-char (region-end))
              (if (bolp)
                  (point)
                (line-beginning-position 2))))
    (cons (line-beginning-position)
          (line-beginning-position 2))))

(defun mp/move-lines--apply (direction)
  "Move the current line or active region one line in DIRECTION."
  (let* ((bounds (mp/line-move-bounds))
         (had-region (use-region-p))
         (start (car bounds))
         (end (cdr bounds)))
    (save-excursion
      (goto-char (if (> direction 0) end start))
      (when (or (and (< direction 0) (= start (point-min)))
                (and (> direction 0) (= end (point-max))))
        (user-error "Cannot move further %s" (if (< direction 0) "up" "down"))))
    (let* ((line-count (count-lines start end))
           (column (current-column))
           (text (delete-and-extract-region start end)))
      (goto-char start)
      (forward-line direction)
      (let ((target (point)))
        (insert text)
        (if had-region
            (progn
              (set-mark target)
              (goto-char (+ target (length text)))
              (setq deactivate-mark nil))
          (goto-char target)
          (forward-line (if (> direction 0) (1- line-count) 0))
          (move-to-column column))))))

(defun mp/move-lines-up ()
  "Move the current line or active region up by one line."
  (interactive)
  (mp/move-lines--apply -1))

(defun mp/move-lines-down ()
  "Move the current line or active region down by one line."
  (interactive)
  (mp/move-lines--apply 1))

;; Global GUI-style bindings.
;; Keeps a terminal toggle, line commenting, and line movement available
;; through familiar keys.
(map! :g "C-`" #'mp/vterm-toggle
      :g "C-\\" #'mp/vterm-new
      :g "C-/" #'comment-line
      :g "M-<up>" #'mp/move-lines-up
      :g "M-<down>" #'mp/move-lines-down)
#+end_src

** Evil State Overrides
#+begin_src emacs-lisp
(after! evil
  (dolist (state-map (list evil-motion-state-map
                           evil-normal-state-map
                           evil-insert-state-map
                           evil-emacs-state-map
                           evil-visual-state-map))
    (define-key state-map (kbd "C-b") #'mp/treemacs-toggle-current-project)
    (define-key state-map (kbd "C-S-e") #'treemacs-find-file)
    (define-key state-map (kbd "C-\\") #'mp/vterm-new)
    (define-key state-map (kbd "C-/") #'comment-line)
    (define-key state-map (kbd "M-<up>") #'mp/move-lines-up)
    (define-key state-map (kbd "M-<down>") #'mp/move-lines-down)))

(defun mp/close-window-preserve-buffer ()
  "Close the selected window without killing popup or terminal buffers."
  (interactive)
  (if (and (featurep '+popup)
           (+popup-window-p))
      (let* ((window (selected-window))
             (buffer (window-buffer window))
             (+popup--inhibit-transient t)
             (ignore-window-parameters t))
        (if-let ((wconf (window-parameter window 'saved-wconf)))
            (set-window-configuration wconf)
          (delete-window window))
        (when (buffer-live-p buffer)
          (with-current-buffer buffer
            (set-buffer-modified-p nil)
            (when (bound-and-true-p +popup-buffer-mode)
              (+popup-buffer-mode -1))
            (bury-buffer buffer))))
    (call-interactively #'delete-window)))

(after! workspaces
  (map! :leader
        (:prefix ("w" . "workspaces/windows")
         :desc "Delete window" "d" #'mp/close-window-preserve-buffer
         :desc "Delete window/workspace" "D" #'+workspace/close-window-or-workspace))
  (map! :map evil-window-map
        "d" #'mp/close-window-preserve-buffer
        "D" #'+workspace/close-window-or-workspace))
#+end_src

** Directory Navigation In Completion
#+begin_src emacs-lisp
(use-package! consult-dir
  :defer t
  :config
  (map! :leader
        :desc "Find file from directory" "." #'find-file
        :desc "Switch directory" "f d" #'consult-dir)
  (map! :map minibuffer-local-completion-map
        "C-x C-d" #'consult-dir
        "C-x C-j" #'consult-dir-jump-file))
#+end_src

** Which-Key Group Labels
Some Doom prefix maps are still present but may show up as generic =+prefix= entries in which-key. These replacements restore readable group names for the menus behind =SPC= and local leader prefixes.

#+begin_src emacs-lisp
(after! which-key
  (when (boundp 'doom-leader-map)
    (which-key-add-keymap-based-replacements doom-leader-map
      "TAB" "workspace"
      "a" "actions"
      "b" "buffers"
      "c" "code"
      "d" "agent"
      "e" "easysession"
      "f" "files"
      "g" "git"
      "h" "help"
      "i" "insert"
      "n" "notes"
      "o" "open"
      "p" "project"
      "q" "quit/session"
      "s" "search"
      "t" "toggle"
      "w" "windows"
      "x" "text")))
#+end_src

