extra/doom/config.org
* Treemacs
Treemacs is configured to show hidden files and to preserve git-state visibility while dimming dotfiles.

#+begin_src emacs-lisp
(after! treemacs
  (setq treemacs-show-hidden-files t)

  (defun mp/treemacs-toggle-current-project ()
    "Toggle Treemacs, always scoped to the current project."
    (interactive)
    (pcase (treemacs-current-visibility)
      ('visible (delete-window (treemacs-get-local-window)))
      (_ (treemacs-display-current-project-exclusively))))

  (defface mp/treemacs-dotfile-face
    '((t :inherit shadow :slant italic))
    "Face used to de-emphasize visible dotfiles in Treemacs.")

  (set-face-attribute 'treemacs-git-ignored-face nil
                      :inherit 'shadow
                      :slant 'italic)
  (set-face-attribute 'treemacs-git-untracked-face nil
                      :foreground "#98c379")
  (set-face-attribute 'treemacs-git-modified-face nil
                      :foreground "#e5c07b"
                      :weight 'semi-bold)
  (set-face-attribute 'treemacs-git-added-face nil
                      :foreground "#61afef"
                      :weight 'semi-bold)
  (set-face-attribute 'treemacs-git-renamed-face nil
                      :foreground "#c678dd")
  (set-face-attribute 'treemacs-git-conflict-face nil
                      :foreground "#e06c75"
                      :weight 'bold)

  (defun mp/treemacs--dotfile-p (path)
    "Return non-nil when PATH points to a visible dotfile or dotdir."
    (let ((name (file-name-nondirectory (directory-file-name path))))
      (and (string-prefix-p "." name)
           (not (member name '("." ".."))))))

  (defun mp/treemacs--append-face (start end face)
    "Append FACE to the existing face property between START and END."
    (let* ((existing (get-text-property start 'face))
           (faces (delete-dups
                   (append (if (listp existing) existing (list existing))
                           (list face)))))
      (put-text-property start end 'face (delq nil faces))))

  (defun mp/treemacs-apply-dotfile-face-h ()
    "Dim dotfiles in the current Treemacs buffer without hiding git status."
    (when (derived-mode-p 'treemacs-mode)
      (let ((inhibit-read-only t)
            (btn (next-button (point-min) t)))
        (while btn
          (let ((path (ignore-errors (treemacs-button-get btn :path))))
            (when (and (stringp path)
                       (mp/treemacs--dotfile-p path))
              (mp/treemacs--append-face
               (button-start btn)
               (button-end btn)
               'mp/treemacs-dotfile-face)))
          (setq btn (next-button (button-end btn) t))))))

  (add-hook 'treemacs-post-buffer-init-hook #'mp/treemacs-apply-dotfile-face-h)
  (add-hook 'treemacs-post-refresh-hook #'mp/treemacs-apply-dotfile-face-h))
#+end_src

* Magit
Magit can refine diff hunks to show the exact changed characters inside a line instead of only marking the entire line as added or removed. That also makes indentation-only edits much easier to see.

#+begin_src emacs-lisp
(after! magit
  (setq magit-diff-refine-hunk 'all
        ;; Keep whitespace visible inside refined hunks so indentation-only
        ;; changes are highlighted instead of being treated as irrelevant.
        magit-diff-refine-ignore-whitespace nil
        ;; Paint actual whitespace problems in both added and removed lines.
        magit-diff-paint-whitespace t
        magit-diff-paint-whitespace-lines 'both
        magit-diff-highlight-trailing t))
#+end_src

* LSP
** Hover Docs
Use =eldoc-box= for multi-line hover documentation in an inline floating frame.

#+begin_src emacs-lisp
(use-package! eldoc-box
  :after lsp-mode
  :hook (lsp-managed-mode . eldoc-box-hover-at-point-mode)
  :config
  (setq eldoc-box-clear-with-C-g t
        eldoc-box-only-multi-line t
        eldoc-box-max-pixel-width 720
        eldoc-box-max-pixel-height 360
        eldoc-box-offset '(16 12 16)))
#+end_src

** LSP Mode
Performance tuning so the language server responds quickly without overwhelming Emacs.

#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-idle-delay 0.1
        lsp-enable-symbol-highlighting t
        lsp-headerline-breadcrumb-enable nil
        lsp-modeline-diagnostics-enable t
        lsp-diagnostics-provider :flycheck
        lsp-auto-guess-root t
        lsp-keep-workspace-alive nil
        lsp-restart 'interactive
        lsp-file-watch-threshold 2500
        lsp-session-file (expand-file-name ".local/etc/lsp-session-v1" doom-user-dir)
        lsp-completion-provider :none))  ; corfu handles completion via capf
(add-hook 'typescript-mode-hook #'lsp!)
(add-hook 'typescript-tsx-mode-hook #'lsp!)
(add-hook 'js-mode-hook #'lsp!)
(add-hook 'js2-mode-hook #'lsp!)
(add-hook 'web-mode-hook #'lsp!)
(add-hook 'svelte-mode-hook #'lsp!)
(add-hook 'python-mode-hook #'lsp!)
(add-hook 'go-mode-hook #'lsp!)
#+end_src

** TailwindCSS LSP
By default =lsp-tailwindcss= calls =lsp-package-path= to find its server, which
returns =nil= when the server was never downloaded via =M-x lsp-install-server=.
That produces the command =(node nil --stdio)= which crashes immediately.

Point it at the globally-installed npm binary instead (resolved via the nvm
=exec-path= set up above), and enable add-on mode so it runs alongside the
TypeScript server rather than competing with it.

#+begin_src emacs-lisp
(after! lsp-tailwindcss
  (setq lsp-tailwindcss-add-on-mode t
        lsp-tailwindcss-server-path
          (executable-find "tailwindcss-language-server")))
#+end_src

** LSP UI And Peek
=lsp-ui= provides the VSCode-like peek modal for definitions and references, plus an inline sideline for diagnostics and code actions. =lsp-ui-doc= is disabled in favour of =eldoc-box= above.

#+begin_src emacs-lisp
(after! lsp-ui
  (setq lsp-ui-doc-enable nil
        lsp-ui-sideline-enable t
        lsp-ui-sideline-show-diagnostics t
        lsp-ui-sideline-show-code-actions t
        lsp-ui-peek-enable t
        lsp-ui-peek-always-show t)

  (map! :n "gd" #'lsp-ui-peek-find-definitions
        :n "gr" #'lsp-ui-peek-find-references
        :n "gI" #'lsp-ui-peek-find-implementation))
#+end_src

** Flycheck
Fast inline diagnostics — errors and warnings appear almost immediately after you stop typing.

#+begin_src emacs-lisp
(after! flycheck
  (setq flycheck-idle-change-delay 0.2
        flycheck-display-errors-delay 0.2))
#+end_src

* Session Behavior
** Emacs

Quit confirmation is disabled for faster exits.

#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)
#+end_src

** EasySession

#+begin_src emacs-lisp
;; (use-package! easysession
;;   :demand t
;;   :init
;;   (map! :leader
;;         (:prefix ("e" . "easysession")
;;          :desc "Save" "s" #'easysession-save
;;          :desc "Load" "l" #'easysession-switch-to
;;          :desc "Rename" "r" #'easysession-rename
;;          :desc "Unload" "d" #'easysession-unload
;;          :desc "Delete" "k" #'easysession-delete))
;;   :config
;;   (setq easysession-save-interval (* 10 60))
;;   (setq easysession-switch-to-save-session t)
;;   (setq easysession-switch-to-exclude-current nil)
;;   (easysession-setup))
#+end_src

* Editing
** Multi Cursor
#+begin_src emacs-lisp
(use-package! evil-mc
  :after evil
  :config
  (global-evil-mc-mode 1)

  (map! :n "C-M-<down>"  #'evil-mc-make-cursor-move-next-line
        :n "C-M-<up>"    #'evil-mc-make-cursor-move-prev-line
        :n "C-M-<right>" #'evil-mc-make-all-cursors)

  (defun my/evil-mc-escape ()
    (interactive)
    (if (and (bound-and-true-p evil-mc-mode)
             evil-mc-cursor-list)
        (evil-mc-undo-all-cursors)
      (evil-force-normal-state)))

  (map! :i "<escape>" #'my/evil-mc-escape
        :n "<escape>" #'my/evil-mc-escape))

(map! :nv "C-d" #'evil-multiedit-match-and-next
      :i  "C-d" #'evil-multiedit-toggle-marker-here)
#+end_src

** Find in project
* Scripts
** Project Scripts runner
#+begin_src emacs-lisp
(defvar my/project-running-scripts (make-hash-table :test 'equal))

(defun my/project-scripts-dir ()
  (expand-file-name "__ignore__/scripts/" (projectile-project-root)))

(defun my/project-script-files ()
  (let ((dir (my/project-scripts-dir)))
    (when (file-directory-p dir)
      (directory-files dir t "\\.sh$"))))

(defun my/project-script-label (file)
  (let* ((project (projectile-project-root))
         (key (concat project "::" file))
         (name (file-name-base file)))
    (if (gethash key my/project-running-scripts)
        (concat "✓ " name)
      name)))

(defun my/run-project-script ()
  "Pick a project script and run it in a vterm buffer."
  (interactive)
  (let* ((project (projectile-project-root))
         (files (my/project-script-files)))
    (unless files
      (user-error "No scripts found in __ignore__/scripts/"))

    (let* ((choices
            (mapcar (lambda (file)
                      (cons (my/project-script-label file) file))
                    files))
           (picked-label (completing-read "Run script: " choices nil t))
           (file (cdr (assoc picked-label choices)))
           (name (file-name-base file))
           (key (concat project "::" file))
           (buf-name (format "*project:%s*" name)))

      (puthash key t my/project-running-scripts)

      (let ((default-directory project))
        (vterm buf-name)
        (vterm-send-string (shell-quote-argument file))
        (vterm-send-return)
        (delete-other-windows)))))

(map! :leader
      :desc "Run project script"
      "p S" #'my/run-project-script)
#+end_src

