extra/doom/config.el
  (setq treemacs-show-hidden-files t)

  (defface mp/treemacs-dotfile-face
    '((t :inherit shadow :slant italic))
    "Face used to de-emphasize visible dotfiles in Treemacs.")

  (set-face-attribute 'treemacs-git-ignored-face nil
                      :inherit 'shadow
                      :slant 'italic)
  (set-face-attribute 'treemacs-git-untracked-face nil
                      :foreground "#98c379")
  (set-face-attribute 'treemacs-git-modified-face nil
                      :foreground "#e5c07b"
                      :weight 'semi-bold)
  (set-face-attribute 'treemacs-git-added-face nil
                      :foreground "#61afef"
                      :weight 'semi-bold)
  (set-face-attribute 'treemacs-git-renamed-face nil
                      :foreground "#c678dd")
  (set-face-attribute 'treemacs-git-conflict-face nil
                      :foreground "#e06c75"
                      :weight 'bold)

  (defun mp/treemacs--dotfile-p (path)
    "Return non-nil when PATH points to a visible dotfile or dotdir."
    (let ((name (file-name-nondirectory (directory-file-name path))))
      (and (string-prefix-p "." name)
           (not (member name '("." ".."))))))

  (defun mp/treemacs--append-face (start end face)
    "Append FACE to the existing face property between START and END."
    (let* ((existing (get-text-property start 'face))
           (faces (delete-dups
                   (append (if (listp existing) existing (list existing))
                           (list face)))))
      (put-text-property start end 'face (delq nil faces))))

  (defun mp/treemacs-apply-dotfile-face-h ()
    "Dim dotfiles in the current Treemacs buffer without hiding git status."
    (when (derived-mode-p 'treemacs-mode)
      (let ((inhibit-read-only t)
            (btn (next-button (point-min) t)))
        (while btn
          (let ((path (ignore-errors (treemacs-button-get btn :path))))
            (when (and (stringp path)
                       (mp/treemacs--dotfile-p path))
              (mp/treemacs--append-face
               (button-start btn)
               (button-end btn)
               'mp/treemacs-dotfile-face)))
          (setq btn (next-button (button-end btn) t))))))

  (add-hook 'treemacs-post-buffer-init-hook #'mp/treemacs-apply-dotfile-face-h)
  (add-hook 'treemacs-post-refresh-hook #'mp/treemacs-apply-dotfile-face-h))

(after! magit
  (setq magit-diff-refine-hunk 'all
        ;; Keep whitespace visible inside refined hunks so indentation-only
        ;; changes are highlighted instead of being treated as irrelevant.
        magit-diff-refine-ignore-whitespace nil
        ;; Paint actual whitespace problems in both added and removed lines.
        magit-diff-paint-whitespace t
        magit-diff-paint-whitespace-lines 'both
        magit-diff-highlight-trailing t))

(use-package! eldoc-box
  :after eglot
  :hook (eglot-managed-mode . eldoc-box-hover-at-point-mode)
  :config
  (setq eldoc-box-clear-with-C-g t
        eldoc-box-only-multi-line t
        eldoc-box-max-pixel-width 720
        eldoc-box-max-pixel-height 360
        eldoc-box-offset '(16 12 16)))

(setq confirm-kill-emacs nil)
